Automation_Selenium/WebApp_Flask/log/automation_CEPTestSuite-consultaCEP_TestCase-tc001_consultaCEP_valido-0-OK.txt

Status: OK
Time Taken: 891
Size: 385
Timestamp: Fri Jan 08 10:07:30 BRST 2021
TestStep: tc001_consultaCEP_valido

----------------- Messages ------------------------------

----------------- Properties ------------------------------
Endpoint: https://apps.correios.com.br/SigepMasterJPA/AtendeClienteService/AtendeCliente
Encoding: UTF-8

---------------- Request ---------------------------
Request Headers: SOAPAction : ""
Connection : Keep-Alive
User-Agent : Apache-HttpClient/4.5.5 (Java/12.0.1)
Host : apps.correios.com.br
Accept-Encoding : gzip,deflate
Content-Length : 332
Content-Type : text/xml;charset=UTF-8


<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cli="http://cliente.bean.master.sigep.bsb.correios.com.br/">
   <soapenv:Header/>
   <soapenv:Body>
      <cli:consultaCEP>
         <!--Optional:-->
         <cep>13482060</cep>
      </cli:consultaCEP>
   </soapenv:Body>
</soapenv:Envelope>

---------------- Response --------------------------
Response Headers: Keep-Alive : timeout=5, max=100
Server : Apache/2.4.38 (Debian)
X-OPNET-Transaction-Trace : a2_875c0233-770d-4826-aabe-3ff3fe7ae28a
Content-Encoding : gzip
Connection : Keep-Alive
Vary : Accept-Encoding,User-Agent
Set-Cookie : _op_aixPageId=a2_875c0233-770d-4826-aabe-3ff3fe7ae28a; Path=/
Set-Cookie : app-%3FINTERNO%3Fpool_proxy_app_sigep_443=PNCCAIAK; Expires=Fri, 08-Jan-2021 12:26:41 GMT; Path=/
Set-Cookie : sto-id-%3FEXTERNO_2%3Fpool_Proxy_reverso_Apps_443=BIABKIMA; Expires=Fri, 08-Jan-2021 12:26:41 GMT; Path=/
#status# : HTTP/1.1 200 OK
Content-Length : 254
Date : Fri, 08 Jan 2021 12:06:41 GMT
Content-Type : text/xml;charset=UTF-8


<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
   <soap:Body>
      <ns2:consultaCEPResponse xmlns:ns2="http://cliente.bean.master.sigep.bsb.correios.com.br/">
         <return>
            <bairro>Jardim Ouro Verde</bairro>
            <cep>13482060</cep>
            <cidade>Limeira</cidade>
            <complemento2/>
            <end>Rua Guido Orsi</end>
            <uf>SP</uf>
         </return>
      </ns2:consultaCEPResponse>
   </soap:Body>
</soap:Envelope>
